class Const:
    """хранение констант"""
    alphabet_upper = 'АБВГДЕЖЗИЙКЛМНОПРСТУФХЦЧШЩЪЫЬЭЮЯ'
    alphabet_lower = 'абвгдежзийклмнопрстуфхцчшщъыьэюя'
    len_of_alphabet = 32
    regular_frequency = [8.01, 1.59, 4.54, 1.70, 2.98, 8.45, 0.04, 0.97, 1.65, 7.35, 1.21, 3.49, 4.40,
                         3.21, 6.70, 10.97, 2.81, 4.73, 5.47, 6.26, 2.62, 0.26, 0.97, 0.48, 1.44, 0.73,
                         0.36, 0.04, 1.90, 1.74, 0.32, 0.64, 2.01]
    order_first_russian_letter = 1040
    order_last_russian_letter = 1105
    vernam_shift = 16